src/main/java/ok/dht/test/yasevich/profiling/stage3/wrk/illness/wrk-get-report-old
Running 1m test @ http://localhost:12353
  8 threads and 64 connections
  Thread calibration: mean lat.: 1257.993ms, rate sampling interval: 4530ms
  Thread calibration: mean lat.: 1169.232ms, rate sampling interval: 4126ms
  Thread calibration: mean lat.: 1220.147ms, rate sampling interval: 4444ms
  Thread calibration: mean lat.: 1157.502ms, rate sampling interval: 4276ms
  Thread calibration: mean lat.: 1153.317ms, rate sampling interval: 4177ms
  Thread calibration: mean lat.: 1151.922ms, rate sampling interval: 4222ms
  Thread calibration: mean lat.: 1177.782ms, rate sampling interval: 4378ms
  Thread calibration: mean lat.: 1181.891ms, rate sampling interval: 4456ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.68s     3.66s   15.79s    57.56%
    Req/Sec     4.67k    83.72     4.86k    66.29%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.69s 
 75.000%   11.86s 
 90.000%   13.75s 
 99.000%   15.05s 
 99.900%   15.38s 
 99.990%   15.74s 
 99.999%   15.80s 
100.000%   15.80s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2271.231     0.000000            1         1.00
    3659.775     0.100000       186850         1.11
    4820.991     0.200000       373643         1.25
    6066.175     0.300000       560805         1.43
    7327.743     0.400000       747513         1.67
    8691.711     0.500000       934252         2.00
    9338.879     0.550000      1028189         2.22
    9961.471     0.600000      1120736         2.50
   10584.063     0.650000      1214816         2.86
   11214.847     0.700000      1307676         3.33
   11862.015     0.750000      1401201         4.00
   12165.119     0.775000      1448144         4.44
   12468.223     0.800000      1494476         5.00
   12779.519     0.825000      1541040         5.71
   13115.391     0.850000      1588580         6.67
   13451.263     0.875000      1635612         8.00
   13598.719     0.887500      1657912         8.89
   13754.367     0.900000      1681901        10.00
   13926.399     0.912500      1705299        11.43
   14082.047     0.925000      1727772        13.33
   14245.887     0.937500      1751530        16.00
   14335.999     0.943750      1763149        17.78
   14426.111     0.950000      1774958        20.00
   14516.223     0.956250      1787129        22.86
   14598.143     0.962500      1798081        26.67
   14688.255     0.968750      1810042        32.00
   14729.215     0.971875      1815337        35.56
   14778.367     0.975000      1821731        40.00
   14827.519     0.978125      1827923        45.71
   14876.671     0.981250      1833716        53.33
   14925.823     0.984375      1839054        64.00
   14958.591     0.985938      1841859        71.11
   14991.359     0.987500      1845134        80.00
   15024.127     0.989062      1847652        91.43
   15056.895     0.990625      1850391       106.67
   15106.047     0.992188      1853744       128.00
   15122.431     0.992969      1855141       142.22
   15147.007     0.993750      1856741       160.00
   15163.391     0.994531      1857947       182.86
   15179.775     0.995313      1859088       213.33
   15204.351     0.996094      1860549       256.00
   15220.735     0.996484      1861300       284.44
   15237.119     0.996875      1862014       320.00
   15261.695     0.997266      1862947       365.71
   15278.079     0.997656      1863624       426.67
   15302.655     0.998047      1864293       512.00
   15319.039     0.998242      1864670       568.89
   15335.423     0.998437      1864942       640.00
   15351.807     0.998633      1865318       731.43
   15368.191     0.998828      1865643       853.33
   15392.767     0.999023      1866116      1024.00
   15400.959     0.999121      1866190      1137.78
   15417.343     0.999219      1866365      1280.00
   15433.727     0.999316      1866584      1462.86
   15450.111     0.999414      1866747      1706.67
   15482.879     0.999512      1866936      2048.00
   15491.071     0.999561      1867010      2275.56
   15515.647     0.999609      1867079      2560.00
   15556.607     0.999658      1867197      2925.71
   15564.799     0.999707      1867260      3413.33
   15638.527     0.999756      1867388      4096.00
   15646.719     0.999780      1867404      4551.11
   15687.679     0.999805      1867535      5120.00
   15687.679     0.999829      1867535      5851.43
   15687.679     0.999854      1867535      6826.67
   15720.447     0.999878      1867600      8192.00
   15720.447     0.999890      1867600      9102.22
   15745.023     0.999902      1867629     10240.00
   15761.407     0.999915      1867662     11702.86
   15769.599     0.999927      1867673     13653.33
   15777.791     0.999939      1867734     16384.00
   15777.791     0.999945      1867734     18204.44
   15777.791     0.999951      1867734     20480.00
   15777.791     0.999957      1867734     23405.71
   15785.983     0.999963      1867754     27306.67
   15785.983     0.999969      1867754     32768.00
   15785.983     0.999973      1867754     36408.89
   15794.175     0.999976      1867783     40960.00
   15794.175     0.999979      1867783     46811.43
   15794.175     0.999982      1867783     54613.33
   15794.175     0.999985      1867783     65536.00
   15794.175     0.999986      1867783     72817.78
   15794.175     0.999988      1867783     81920.00
   15802.367     0.999989      1867804     93622.86
   15802.367     1.000000      1867804          inf
#[Mean    =     8678.492, StdDeviation   =     3662.038]
#[Max     =    15794.176, Total count    =      1867804]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2246189 requests in 1.00m, 152.17MB read
  Non-2xx or 3xx responses: 1488373
Requests/sec:  37437.13
Transfer/sec:      2.54MB